wirepas/wm-sdk/mcu/efr32/vendor/em_iadc.c
        // Set correct gain correction bitfields in scale variable.
        tmp = (uint32_t)uiGainCAna & 0x9FFFU;
        scale = tmp << _IADC_SCALE_GAIN13LSB_SHIFT;
        if ((tmp & 0x8000U) != 0U) {
          scale |= IADC_SCALE_GAIN3MSB;
        }

        // Adjust offset according to selected OSR.
        iOsr = 1U << (((iadc->CFG[config].CFG & _IADC_CFG_OSRHS_MASK) >> _IADC_CFG_OSRHS_SHIFT) + 1U);
        if (iOsr == 2) {
          if (adcMode == iadcCfgModeNormal) {
            offset += (int16_t)(DEVINFO->IADC0NORMALOFFSETCAL0 & _DEVINFO_IADC0NORMALOFFSETCAL0_OFFSETANA1NORM_MASK);
          } else {
            offset += (int16_t)(DEVINFO->IADC0HISPDOFFSETCAL0 & _DEVINFO_IADC0HISPDOFFSETCAL0_OFFSETANA1HISPD_MASK);
          }
        } else {
          if (adcMode == iadcCfgModeNormal) {
            offset = (int16_t)(DEVINFO->IADC0NORMALOFFSETCAL1 & _DEVINFO_IADC0NORMALOFFSETCAL1_OFFSETANA3NORM_MASK) - offset;
          } else {
            offset += (int16_t)(DEVINFO->IADC0HISPDOFFSETCAL1 & _DEVINFO_IADC0HISPDOFFSETCAL1_OFFSETANA3HISPD_MASK) - offset;
          }
          offset /= iOsr / 2.0f;
          offset += (int16_t)(DEVINFO->IADC0OFFSETCAL0 & _DEVINFO_IADC0OFFSETCAL0_OFFSETANABASE_MASK);
        }

        // Compensate offset according to selected reference voltage.
        offset *= 1.25f / (allConfigs->configs[config].vRef / 1000.0f);

        // Compensate offset for systematic offset.
        offset = (offset * 4.0f) + (640.0f * (256.0f / iOsr));

        // Apply gain error correction.
        if (scale != 0x80000000U) {
          offset = (uiGainCAna / 32768.0f) * (offset + 524288.0f) - 524288.0f;
        }

        iOffset = IADC_ROUND_D2I(-offset);
        // We only have 18 bits available for OFFSET in SCALE register.
        // OFFSET is a 2nd complement number.
        if (iOffset > 131071) {         // Positive overflow at 0x0001FFFF ?
          scale |= 0x1FFFFU;
        } else if (iOffset < -131072) { // Negative overflow at 0xFFFE0000 ?
          scale |= 0x20000U;
        } else {
          scale |= (uint32_t)iOffset & 0x3FFFFU;
        }
        iadc->CFG[config].SCALE = scale;
        break;

#if defined(_IADC_CFG_ADCMODE_HIGHACCURACY)
      case iadcCfgModeHighAccuracy:
        switch (allConfigs->configs[config].reference) {
          case iadcCfgReferenceInt1V2:
            refVoltage = 1.21;
            break;
          case iadcCfgReferenceExt1V25:
            refVoltage = 1.25;
            break;
#if defined(_IADC_CFG_REFSEL_VREF2P5)
          case iadcCfgReferenceExt2V5:
            refVoltage = 2.5;
            break;
#endif
          case iadcCfgReferenceVddx:
            refVoltage = 3.0;
            break;
          case iadcCfgReferenceVddX0P8Buf:
            refVoltage = 2.4;
            break;
#if defined(_IADC_CFG_REFSEL_VREFBUF)
          case iadcCfgReferenceBuf:
            refVoltage = 1.25;
            break;
#endif
#if defined(_IADC_CFG_REFSEL_VREF0P8BUF)
          case iadcCfgReference0P8Buf:
            refVoltage = 1.0;
            break;
#endif
          default:
            EFM_ASSERT(false);
            break;
        }

        // Get OSR from config register
        osrValue = (iadc->CFG[config].CFG & _IADC_CFG_OSRHA_MASK) >> _IADC_CFG_OSRHA_SHIFT;

        // 1. Calculate gain correction
        if (osrHiAcc[osrValue] == 92.0) {
          // for OSR = 92, gainSysHiAcc = 0.957457
          gainSysHiAcc = 0.957457;
        } else {
          // for OSR != 92, gainSysHiAcc = OSR/(OSR + 1)
          gainSysHiAcc = osrHiAcc[osrValue] / (osrHiAcc[osrValue] + 1);
        }
        anaGain = (float) uiGainCAna / 32768.0f * gainSysHiAcc;
        anaGainRound =  IADC_ROUND_D2I(32768.0f * anaGain);
        IADC0->CFG[config].SCALE &= ~_IADC_SCALE_MASK;

        // Write GAIN3MSB
        if ((uint32_t)anaGainRound & 0x8000) {
          IADC0->CFG[config].SCALE |= IADC_SCALE_GAIN3MSB_GAIN100;
        } else {
          IADC0->CFG[config].SCALE |= IADC_SCALE_GAIN3MSB_GAIN011;
        }
        // Write GAIN13LSB
        IADC0->CFG[config].SCALE |= ((uint32_t)anaGainRound & 0x1FFF) << _IADC_SCALE_GAIN13LSB_SHIFT;

        // Get offset value for high accuracy mode from DEVINFO
        offsetAna1HiAccInt = (uint16_t)(DEVINFO->IADC0OFFSETCAL0 & _DEVINFO_IADC0OFFSETCAL0_OFFSETANA1HIACC_MASK)
                             >> _DEVINFO_IADC0OFFSETCAL0_OFFSETANA1HIACC_SHIFT;

        // 2. OSR adjustment
        // Get offset from DEVINFO
        offsetAnaBase = (int16_t)(DEVINFO->IADC0OFFSETCAL0 & _DEVINFO_IADC0OFFSETCAL0_OFFSETANABASE_MASK)
                        >> _DEVINFO_IADC0OFFSETCAL0_OFFSETANABASE_SHIFT;
        offsetAna = offsetAnaBase + (offsetAna1HiAccInt) / (2 ^ osrValue);

        // 3. Reference voltage adjustment
        offsetAna = (offsetAna) * (1.25f / refVoltage);

        // 4. Calculate final offset
        offset2 = 262144.0f / osrHiAcc[osrValue] / (osrHiAcc[osrValue] + 1) + offsetAna * 4.0f + 524288.0f;
        offset2 = (uiGainCAna / 32768.0f * (-1.0)) * offset2 + 524288.0f;
        offsetLong = IADC_ROUND_D2I(offset2);

        // 5. Write offset to scale register
        IADC0->CFG[config].SCALE |= (uint32_t)(offsetLong & _IADC_SCALE_OFFSET_MASK);
        break;
#endif
      default:
        // Mode not supported.
        EFM_ASSERT(false);
        break;
    }
    iadc->CFG[config].SCHED = ((adcClkPrescale << _IADC_SCHED_PRESCALE_SHIFT)
                               & _IADC_SCHED_PRESCALE_MASK);
  }
  IADC_enable(iadc);
}

/***************************************************************************//**
 * @brief
 *   Initialize IADC scan sequence.
 *
 * @details
 *   This function will configure scan mode and set up entries in the scan
 *   table. The scan table mask can be updated by calling IADC_updateScanMask.
 *
 * @note
 *   This function will stop any ongoing conversions.
 *
 * @note If an even numbered pin is selected for the positive input, the
 *   negative input must use an odd numbered pin and vice versa.
 *
 * @param[in] iadc
 *   Pointer to IADC peripheral register block.
 *
 * @param[in] init
 *   Pointer to IADC initialization structure.
 *
 * @param[in] scanTable
 *   Pointer to IADC scan table structure.
 ******************************************************************************/
void IADC_initScan(IADC_TypeDef *iadc,
                   const IADC_InitScan_t *init,
                   const IADC_ScanTable_t *scanTable)
{
  uint32_t i;
  uint32_t tmp;
  EFM_ASSERT(IADC_REF_VALID(iadc));
#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_3)
  // Errata IADC_E305. Makes sure that DVL is equal or less than 7 entries.
  EFM_ASSERT(init->dataValidLevel <= iadcFifoCfgDvl7);
#endif

  IADC_disable(iadc);

  iadc->SCANFIFOCFG = (((uint32_t) (init->alignment) << _IADC_SCANFIFOCFG_ALIGNMENT_SHIFT)
                       & _IADC_SCANFIFOCFG_ALIGNMENT_MASK)
                      | (init->showId ? IADC_SCANFIFOCFG_SHOWID : 0UL)
                      | (((uint32_t) (init->dataValidLevel) << _IADC_SCANFIFOCFG_DVL_SHIFT)
                         & _IADC_SCANFIFOCFG_DVL_MASK)
                      | (init->fifoDmaWakeup ? IADC_SCANFIFOCFG_DMAWUFIFOSCAN : 0UL);

  // Clear bitfields for scan conversion in IADCn->TRIGGER and set new values
  iadc->TRIGGER = (iadc->TRIGGER & ~(_IADC_TRIGGER_SCANTRIGSEL_MASK
                                     | _IADC_TRIGGER_SCANTRIGACTION_MASK))
                  | (((uint32_t) (init->triggerSelect) << _IADC_TRIGGER_SCANTRIGSEL_SHIFT)
                     & _IADC_TRIGGER_SCANTRIGSEL_MASK)
                  | (((uint32_t) (init->triggerAction) << _IADC_TRIGGER_SCANTRIGACTION_SHIFT)
                     & _IADC_TRIGGER_SCANTRIGACTION_MASK);

  // Write scan table
  for (i = 0; i < IADC_SCANENTRIES(iadc); i++) {
    iadc->SCANTABLE[i].SCAN = (((uint32_t) (scanTable->entries[i].negInput) << _IADC_SCAN_PINNEG_SHIFT)
                               & (_IADC_SCAN_PORTNEG_MASK | _IADC_SCAN_PINNEG_MASK))
                              | (((uint32_t) (scanTable->entries[i].posInput) << _IADC_SCAN_PINPOS_SHIFT)
                                 & (_IADC_SCAN_PORTPOS_MASK | _IADC_SCAN_PINPOS_MASK))
                              | (((uint32_t) (scanTable->entries[i].configId) << _IADC_SCAN_CFG_SHIFT)
                                 & _IADC_SCAN_CFG_MASK)
                              | (scanTable->entries[i].compare ? IADC_SCAN_CMP : 0UL);
  }

  IADC_enable(iadc);

